---
kind: type
id: T:Autodesk.Revit.DB.Structure.AnalyticalLink
source: html/b552fb54-8dff-6690-e16e-cc46cbc46d6b.htm
---
# Autodesk.Revit.DB.Structure.AnalyticalLink

An analytical link element that is used to create connections between other Analytical Elements.

## Syntax (C#)
```csharp
public class AnalyticalLink : Element
```